app/controllers/comments_controller.rb

SELECT * FROM "shares" WHERE ("shares".user_id = 746491306) LIMIT 1
INSERT INTO "comments" ("created_at", "body", "updated_at", "user_id", "share_id") VALUES('2009-10-28 18:24:55', 'I saw Fly last April and they played really well. ', '2009-10-28 18:24:55', 1, 7)
INSERT INTO "shares" ("created_at", "title", "updated_at", "votes_count", "user_id", "link", "description") VALUES('2009-11-11 17:28:39', 'Ornette Coleman', '2009-11-11 17:28:39', 0, 746491306, 'http://oc.com/', NULL)
---
    def create
       @share = Share.find(params[:share_id])
         @comment = @share.comments.create(params[:comment].merge(:user => @current_user))