app/controllers/shares_controller.rb

  def create
    @share = @current_user.shares.build params[:share]
    if @share.save
---
INSERT INTO "shares" ("cached_tag_list", "created_at", "title", "updated_at", "votes_count", "user_id", "link", "description") VALUES('prhonesis, trio, piano', '2009-11-12 18:10:59', 'Phronesis', '2009-11-12 18:10:59', 0, 2, 'http://www.jasperhoiby.com/live/', 'Interesting trio with Jasper Hoiby on bass, Ive Neame on piano and Anton Enger on drums. Similar to Avishai Cohen''s piano trios.')

  def show
    @share = Share.find(params[:id])
---
SELECT * FROM "shares" WHERE ("shares"."id" = 2)