app/controllers/tags_controller.rb

SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN shares ON shares.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Share') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
---
  def show
    @shares = Share.find_tagged_with(params[:id])