app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT "shares".* FROM "shares" INNER JOIN "votes" ON "shares".id = "votes".share_id WHERE (("votes".user_id = 1)) ORDER BY votes.id DESC LIMIT 6
---
  def show
    @user = User.find(params[:id])
    @shares_submitted = @user.shares.find(:all,
      :limit => 6, :order => 'shares.id DESC')