app/controllers/votes_controller.rb

SELECT * FROM "shares" WHERE ("shares"."id" = 2)
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "share_id") VALUES('2009-10-19 20:27:55', '2009-10-19 20:27:55', NULL, 3)
---
  def create
    @share = Share.find(params[:share_id])
    @share.votes.create(:user => @current_user)